# Conexão com postgres e Relatorios do Sistema

## Instalando biblioteca de acesso com postgres e manipulação de dados e gráficos

In [4]:
!pip install --user psycopg2-binary
!pip install --user seaborn
!pip install --user pandas

Requirement already satisfied: psycopg2-binary in c:\users\leonardo\appdata\roaming\python\python37\site-packages (2.7.6.1)
Collecting seaborn
  Using cached https://files.pythonhosted.org/packages/a8/76/220ba4420459d9c4c9c9587c6ce607bf56c25b3d3d2de62056efe482dadc/seaborn-0.9.0-py3-none-any.whl
Collecting scipy>=0.14.0 (from seaborn)
  Using cached https://files.pythonhosted.org/packages/c4/f3/752fd6778a9d07fddb2b02dac5895287e594d2d0d156a2a422c710f6a851/scipy-1.1.0-cp37-none-win_amd64.whl
Collecting matplotlib>=1.4.3 (from seaborn)
  Using cached https://files.pythonhosted.org/packages/5c/ee/efaf04efc763709f6840cd8d08865d194f7453f43e98d042c92755cdddec/matplotlib-3.0.2-cp37-cp37m-win_amd64.whl
Requirement already satisfied: pandas>=0.15.2 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from seaborn) (0.23.4)
Requirement already satisfied: numpy>=1.9.3 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from seaborn) (1.15.4)
Collecting kiwisolver>=1.0.1 (from matplotlib>=1.4.3->seaborn)
  Downloading https://files.pythonhosted.org/packages/7c/be/7ae355b45699460e369ebf88d86058fca26827933974cc3f6b6b7800a324/kiwisolver-1.0.1-cp37-none-win_amd64.whl (57kB)
Collecting cycler>=0.10 (from matplotlib>=1.4.3->seaborn)
  Downloading https://files.pythonhosted.org/packages/f7/d2/e07d3ebb2bd7af696440ce7e754c59dd546ffe1bbe732c8ab68b9c834e61/cycler-0.10.0-py2.py3-none-any.whl
Collecting pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 (from matplotlib>=1.4.3->seaborn)
  Downloading https://files.pythonhosted.org/packages/71/e8/6777f6624681c8b9701a8a0a5654f3eb56919a01a78e12bf3c73f5a3c714/pyparsing-2.3.0-py2.py3-none-any.whl (59kB)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from matplotlib>=1.4.3->seaborn) (2.7.5)
Requirement already satisfied: pytz>=2011k in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from pandas>=0.15.2->seaborn) (2018.7)
Requirement already satisfied: setuptools in c:\users\leonardo\appdata\local\programs\python\python37\lib\site-packages (from kiwisolver>=1.0.1->matplotlib>=1.4.3->seaborn) (39.0.1)
Requirement already satisfied: six in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from cycler>=0.10->matplotlib>=1.4.3->seaborn) (1.11.0)
Installing collected packages: scipy, kiwisolver, cycler, pyparsing, matplotlib, seaborn
Successfully installed cycler-0.10.0 kiwisolver-1.0.1 matplotlib-3.0.2 pyparsing-2.3.0 scipy-1.1.0 seaborn-0.9.0
Requirement already satisfied: pandas in c:\users\leonardo\appdata\roaming\python\python37\site-packages (0.23.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from pandas) (2.7.5)
Requirement already satisfied: numpy>=1.9.0 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from pandas) (1.15.4)
Requirement already satisfied: pytz>=2011k in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from pandas) (2018.7)
Requirement already satisfied: six>=1.5 in c:\users\leonardo\appdata\roaming\python\python37\site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)

### Importando bibliotecas

In [9]:
import seaborn as sns
import pandas as pd
import psycopg2

### Usando psycopg2 para configurar conexão

In [17]:
conn = psycopg2.connect(host="localhost", database="relatorio", user="root", password="123")

OperationalError: FATAL:  password authentication failed for user "postgresql"

## Obtendo dados do database com Pandas

# Relatório 1

### Objetivo: Relarótio de veiculos disponíveis incluindo as seguintes informações: id do veiculo, nome do veiculo, categoria do veiculo e status do veiculo.

Código para obtenção do resultado:

In [5]:
test = pd.read_sql_query("""
                            SELECT VC.ID,VC.NOME,CV.CATEGORIA,SV.STATUS FROM VEICULO AS VC
                            INNER JOIN STATUS_VEICULO AS SV
                            ON (SV.ID = VC.ID_STATUS)
                            INNER JOIN CATEGORIA_VEICULO AS CV
                            ON (CV.ID = VC.ID_CATEGORIA)
                            WHERE SV.STATUS = 'DISPONIVEL'
                            """,conn)

In [6]:
test

   id nome categoria      status
0   6    .   CARRETA  DISPONIVEL
1   5    .     CARRO  DISPONIVEL
2   4    .  CAMINHAO  DISPONIVEL
3   3    .  CAMINHAO  DISPONIVEL

# Relatorio2

### Objetivo: Relatório de motoristas e suas CNHs incluindo as seguintes informações: id do motorista, nome do motorista, numero da cnh, categoria e data de vencimento da mesma.

codigo para obtenção do resultado:

In [7]:
result = pd.read_sql_query("""
                            SELECT MOT.ID,PESSOA.NOME,MOT.NUMERO_CNH,CATEGORIA_CNH.CATEGORIA,MOT.DATA_VENCIMENTO FROM MOTORISTA AS MOT
                            INNER JOIN CATEGORIA_CNH
                            ON (CATEGORIA_CNH.ID = MOT.ID_CATEGORIA_CNH)
                            INNER JOIN FUNCIONARIO AS FUN
                            ON (FUN.ID = MOT.ID_FUNCIONARIO)
                            INNER JOIN PESSOA_FISICA
                            ON (PESSOA_FISICA.ID = FUN.ID_PESSOA_FISICA)
                            INNER JOIN PESSOA
                            ON (PESSOA.ID = PESSOA_FISICA.ID_PESSOA)
                            """,conn)

In [8]:
result

   id            nome   numero_cnh categoria data_vencimento
0   1     Thales Real  65137192579        AC      2020-10-10
1   2      Cauã Pires  05808723119        AD      2022-05-10
2   3   Elias Peixoto  46569685935        BC      2019-09-10
3   4  Gustavo Araújo  15671759904        BD      2025-09-19

# Relatório 3

### Relatório de salários dos funcionários incluindo as seguintes informações: nome do funcionário, salário do funcionário.

In [9]:
result3 = pd.read_sql_query("""
                                SELECT PESSOA.NOME, FUN.SALARIO FROM FUNCIONARIO AS FUN
                                INNER JOIN PESSOA_FISICA
                                ON (PESSOA_FISICA.ID = FUN.ID_PESSOA_FISICA)
                                INNER JOIN PESSOA
                                ON (PESSOA.ID = PESSOA_FISICA.ID_PESSOA)
                                """,conn)

In [10]:
result3

                   nome  salario
0           Thales Real   3300.0
1  Ryan Augusto da Mata   5000.0
2        Tomás da Cunha   4200.0
3            Cauã Pires   2200.0
4         Elias Peixoto   3500.0
5        Gustavo Araújo   3000.0

# Relatório 4

### Relatório informando a quantidades de serviços por tipo de carga e faturamento de cada tipo incluindo as seguintes informações: tipo da carga e a quantidade de serviços do tipo de carga e valor obtido pelos serviços.

In [11]:
result4 = pd.read_sql_query("""
                                SELECT TC.TIPO,COUNT(TRANSPORTE.ID), SUM(VALOR_CONTRATO)AS FATURAMENTO FROM TRANSPORTE
                                INNER JOIN TIPO_CARGA AS TC
                                ON (TC.ID = TRANSPORTE.ID_TIPO_CARGA)
                                GROUP BY TC.TIPO
                                """,conn)

In [12]:
result4

          tipo  count  faturamento
0  FRIGORIFICA      2       4500.0
1   CONSTRUCAO      1       4500.0
2      VEICULO      2      13000.0
3       FRAGIL      1       7200.0

# Relatório 5

### Relatório de serviço por periodo incluindo as seguintes informações: id serviço, cliente , status.

In [13]:
result5 = pd.read_sql_query("""
                                SELECT TRANSPORTE.ID AS ID_TRANSPORTE, PESSOA.NOME AS NOME_CLIENTE, STATUS_TRANSPORTE.STATUS FROM TRANSPORTE
                                INNER JOIN STATUS_TRANSPORTE
                                ON(STATUS_TRANSPORTE.ID = TRANSPORTE.ID_STATUS)
                                INNER JOIN PESSOA
                                ON (PESSOA.ID = TRANSPORTE.ID_CLIENTE)
                                WHERE TRANSPORTE.DATA_INICIO BETWEEN '2018-01-01' AND '2018-06-06'
                                """,conn)

In [14]:
result5

   id_transporte                      nome_cliente        status
0              4  Luzia e Malu Telecomunicações ME     CONCLUIDO
1              3     Teresinha e Esther Adega Ltda     CONCLUIDO
2              1         Davi e Helena Entulhos ME     CONCLUIDO
3              2      Emilly e Rebeca Padaria Ltda  EM ANDAMENTO

# Referencias

https://pandas.pydata.org/pandas-docs/stable/style.html <br>
https://pythonspot.com/matplotlib-bar-chart/<br>
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html <br>